export default class workExperience {
  static works = [
    {
      company: "ООО Интенса",
      position: "Старший тестировщик",
      responsibilities: `- Написание чек-листов, тест-кейсов, баг-репортов;
      - Проведение функционального, регрессионного, кроссбраузерного тестирования (browserstack), тестирование UI, тестирование API (REST) (Postman), тестирование верстки через Pixel Perfect;
      - описание особенностей проектов;
      - уточнение требований по документации;
      - корректировка задач для тестировщиков;
      - автотесты на ghost inspector (JavaScript);
      - создание скриптов на js для выполнения в консоли веб браузера (сверка текста, вывод данных по элементам, devtools + JavaScript), небольших инструментов типа отправщика писем (node js + nodemailer + express) для проверки верстки писем;
      - участие в поиске второго тестировщика, проведение собеседования, обучение;
      - подготовка демонстрационного проекта на Cypress (End-to-end тесты для заказчика);
      - построение тестирования с нуля (до этого в организации тестировщиков не было).
      Работа с сайтами: https://mindbox.ru/ https://www.panchemodan.ru/ + мобильные приложения.
      Работа с модулем mindbox`,
    },
    {
      company: "ООО Выберу.ру",
      position: "Тестировщик ПО",
      responsibilities: `Написание чек-листов, баг репортов, тест-кейсов, проведение функционального, регрессионного, кроссбраузерного, UI тестирования, автотесты на связке C# + Selenoid + Selenium + паттерн Page Object (End-to-end тесты).
      4 месяца QA lead (2 тестировщика). Отчет во время созвонов о команде, распределение задач, определение необходимых автотестов для проекта, расписывание автотестов для тестеров, создание хелперов для уменьшение количества единообразного кода, обучение нового сотрудника.
      Тестируемый проект банковский агрегатор: https://www.vbr.ru/ (+мобильные приложения)
      Инструменты: postman, browserstack, selenium, azura, devtools
        (lighthouse, elements, console, sources, networks, device toolbar,
        perfect pixel), selenium, selenoid, google таблицы`,
    },
    {
      company: "ООО Смартек",
      position: "Тестировщик ПО",
      responsibilities: `Деятельность в рамках тестирования мобильного ПО и web-сайтов:
    - составление чек-листов и тест-кейсов после анализа спецификаций или ожиданий заказчика;
    - функциональное тестирование;
    - регрессионное тестирование;
    - оформление баг-репортов и проведение подтверждающего тестирования;
    - взаимодействие с командой разработки.`,
    },
    {
      company: "ООО Атбит",
      position: "Специалист технической поддержки",
      responsibilities: `- Помощь пользователям при работе с доработанной конфигурацией "Управление торговлей";
    - анализ ошибок пользователей при работе с ПО;
    - исправление небольших багов, связанных с доработками и переходом на новую версию конфигурации;
    - небольшие доработки для удобства пользователей;
    - написание инструкций для пользователей.`,
    },
    {
      company: "ООО АйТи Тест",
      position: "Инженер-тестировщик",
      responsibilities: `- работа со снифферами (Fiddler, Charles)
    - анализ сетевого трафика, подмена запросов и ответов;
    - сбор логов через Android Studio (ADM);
    - работа с инструментами разработчика браузеров;
    -написание чек-листов;
    -оформление багов в багтрекере Redmine;
    -написание тест-кейсов;
    
    При тестировании сайта использовались следующие виды тестирования:
    -функциональное;
    -регрессионное.
    
    Организация команды при тестировании, участие в обсуждении работ с менеджером и программистом, предоставление актуальной информации о состоянии проекта.`,
    },
    {
      company: "ООО СервисКлауд",
      position: "Программист 1С",
      responsibilities: `Проведение консультаций для пользователей по конфигурации "Бухгалтерия", анализ ошибок, формирование первоначальных запросов на доработку конфигурации, взаимодействие с разработчиками, менеджерами.`,
    },
    {
      company: "ООО ТрекКонтроль",
      position: "Специалист технической поддержки",
      responsibilities: `Подготовка учетных записей с добавлением и настройкой объектов мониторинга и прав пользователей; помощь пользователям ПО в освоении основ работы системы мониторинга транспортных средств; подготовка оборудования перед установкой на автомобили; оформление документов для производства карт водителей (для тахографов); выставление счетов, создание актов-сверок в 1С:Бухгалтерия 8.3; обновление информации о товарах и ценах на сайте (сайт на основе cms Битрикс); подготовка и отправка`,
    },
  ];
}
